#include <stdint.h>
#include <stdbool.h>
//=====================================================================================================================================================
#define MAIN_TIMER_BITS  int16_t                            // Разрядность главного таймера. Полезным значением являеться половина диапазона (int16_t - max 32,7s)
//=====================================================================================================================================================
void            MainTimerInit(void);                        // Инициализация таймера
MAIN_TIMER_BITS MainTimerSet(MAIN_TIMER_BITS add_time_ms);  // Установка таймера
MAIN_TIMER_BITS MainTimerIsExpired(MAIN_TIMER_BITS delay);  // Проверка таймера
//=====================================================================================================================================================
